In [2]:
import pandas as pd
from collections import OrderedDict

In [3]:
# 핵심은 오직 리스트 구조만을 이용해서 중간에 from_dict을 만나 dictionary형변환이 이루어진걸 추측해 볼수 있음.
friend_list = [ 
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [4]:
# index(1~2)의 row값을 선택해서 보여준다. 
print(df[1:3])
print()
df[:]

name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [6]:
df.loc[0:1,'name':'age'] # 0~2사이의 로우 인덱스 전체를 보여주는게 아닌 0번째, 2번째 딸랑 보여줄 뿐임.
                         # 'name':'job'해도 그것만 딸랑해서 보여줌.
                         # 저 순서를 그대로 유지해야함. 파라미터 첫번째로 컬럼의 이름이나 숫자를 적으면 error
                         # 컬럼을 하나만 적을 경우 해당 값이 Series로 값이 출력됩니다.
            
            
# df.iloc[0:2,'name':'age'] <-- 이게 안되는 이유는 iloc메소드는 특별히 컬럼이 숫자일때만 쓰임.
# 빈먄에 loc[:,'문자열':'문자열'] 향테민 가능함.

# 쉽게 iloc는 컬럼을 숫자로만 조회할 수 있습니다.

    name  age
0   John   20
1  Jenny   30

In [74]:
# loc(loccation) 메소드를 이용함.
# 단 loc[]안에 또 []를 넣고 조회 할 수 있음. 
df.loc[[2,1,0,]] # row index(0번째와 2번째)를 보기위함임. 중간에 콤마 , 가 있음에 유의 
                 # 왼쪽 파라미터부터 특정 index값 하나씩 불러서 조회함.

df.loc[1:2]      # 전형적인 문자열 슬라이싱 방법을 사용할 수 있음.

                 # 위의 첫번째와, 두번째의 가장 큰 차이점은 [] 한번 사용? [[]] 이중으로 사용하냐?
                 # 첫번째는 내가 원하는 방법으로 기존 끝에 있는 로우를 첫번째 로우로 배치할수 있음. 
                 # 두번째는 기존 문자열 슬라이싱 방법과 동일하다.

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [33]:
df = df.loc[[0,2]]
df

   name  age      job
0  John   20  student
2  Nate   30  teacher

### by column condition
#### column의 컨디션에 따라서 row를 선택하는것! 
예, age컬럼에서 25살 이상의 데이터를 보고 싶다면 아래와 같이 하면 됨.      

아래 3가지 방법을 살펴 보자.    

    첫 번째, df[df.컬럼명 > 데이터값]   
    두 번째, df.loc[df.age > 25]   
    세 번쨰, df.query("header명 >25 ")

In [38]:
df[df.age > 25]

   name  age      job
2  Nate   30  teacher

In [9]:
df.loc[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [39]:
# query() 메소드는 소괄호를 써야함. 대괄호(x),중괄호(x)
df.query('age>25')

   name  age      job
2  Nate   30  teacher

### 조금더 복잡한 조건을 줘보자.

In [45]:
df[(df.age>25) & (df.name == 'Nate')]

   name age      job
2  Nate  30  teacher

### Filter Column   
컬럼을 필터하는 방법을 살펴보자.    
#### 1. by index

In [83]:
friend_list = [
     ['John', 20, 'student'],
     ['Jenny', 30, 'developer'],
     ['Nate', 30, 'teacher'] 
     ]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [85]:
# 3번째 컬럼, 즉 2번 index빼고 다 보고 싶을 경우에는! 
# iloc(index location)를 사용한다. 
df.iloc[:,0:2]
# ,를 기준으로 왼쪽은 row index값들의 나열이고  오른쪽은 column인덱스 값들의 나열이다.

       0   1
0   John  20
1  Jenny  30
2   Nate  30

## by column name   
컴럼 이름으로 조회 하는 방법

In [107]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names=['name', 'age', 'job'])
df

# 문자열 name과 age

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [104]:
# df[[ 컬럼명  , 컬럼명   ]]
# df[( 컬럼명  , 컬럼명   )]  
# df[{ 컬럼명  , 컬럼명   }]
# 소괄호(x),중괄호(0) 
df_filtered1 = df[['name','job','age']]
# print( df_filtered1 )

df_filtered2 = df[{'age','name'}]
df_filtered2

   age   name
0   20   John
1   30  Jenny
2   30   Nate

In [106]:
# 필터 메소드를 사용해서 컬럼의 아이템들을 걸러 낼수 있다. 
df.filter(items = ['age' ,'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher

In [108]:
# items의 속성값들 묶을때 소,중,대괄호 어느것으로 묶어도 가능(O)
df.filter(items = ('age' ,'job'))

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [110]:
# filter 메소드를 이용 컬럼 name의 'a'가 있는것만 확인 하고 싶을 때
# 여기서 파라미터 axis는 축을 의미한다. 
# axis=0은 x축만, axis = 2는 x,y축 모두를 의미한다. 
# axis =3일 경우 3차원에 해당된다. x,y,z축
# 그리고 like라는 parameter로 찾길 원하는 '문자열'단하나라도 입력해도 잡힘.

df.filter(like='a', axis=1)
# 실제 응용방법 지역명을 조회할때. '서울'만 보고 싶을때, 특정 그룹에 분포한 사람만 조회할때.

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [92]:
# 만약 컴럼 job처럼 b로 끝나는 문자열을 조회 하고 싶다면?! 
# regex는 regular expression인 정규표현식을 의미함.
# b$에서 달러표시는 마지막 단어가 b로 끝나는걸 의미함.
df.filter(regex='b$',axis =1) # 한글도 가능할지 의문.. 만약 특별시만 조회하고 싶으면 '~특별시$'하면 될까?

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern